/* automatically generated by rust-bindgen 0.60.1 */

pub const DAQmx_Buf_Input_BufSize: u32 = 6252;
pub const DAQmx_Buf_Input_OnbrdBufSize: u32 = 8970;
pub const DAQmx_Buf_Output_BufSize: u32 = 6253;
pub const DAQmx_Buf_Output_OnbrdBufSize: u32 = 8971;
pub const DAQmx_SelfCal_Supported: u32 = 6240;
pub const DAQmx_SelfCal_LastTemp: u32 = 6244;
pub const DAQmx_ExtCal_RecommendedInterval: u32 = 6248;
pub const DAQmx_ExtCal_LastTemp: u32 = 6247;
pub const DAQmx_Cal_UserDefinedInfo: u32 = 6241;
pub const DAQmx_Cal_UserDefinedInfo_MaxSize: u32 = 6428;
pub const DAQmx_Cal_DevTemp: u32 = 8763;
pub const DAQmx_Cal_AccConnectionCount: u32 = 12267;
pub const DAQmx_Cal_RecommendedAccConnectionCountLimit: u32 = 12268;
pub const DAQmx_AI_Max: u32 = 6109;
pub const DAQmx_AI_Min: u32 = 6110;
pub const DAQmx_AI_CustomScaleName: u32 = 6112;
pub const DAQmx_AI_MeasType: u32 = 1685;
pub const DAQmx_AI_Voltage_Units: u32 = 4244;
pub const DAQmx_AI_Voltage_dBRef: u32 = 10672;
pub const DAQmx_AI_Voltage_ACRMS_Units: u32 = 6114;
pub const DAQmx_AI_Temp_Units: u32 = 4147;
pub const DAQmx_AI_Thrmcpl_Type: u32 = 4176;
pub const DAQmx_AI_Thrmcpl_ScaleType: u32 = 10704;
pub const DAQmx_AI_Thrmcpl_CJCSrc: u32 = 4149;
pub const DAQmx_AI_Thrmcpl_CJCVal: u32 = 4150;
pub const DAQmx_AI_Thrmcpl_CJCChan: u32 = 4148;
pub const DAQmx_AI_RTD_Type: u32 = 4146;
pub const DAQmx_AI_RTD_R0: u32 = 4144;
pub const DAQmx_AI_RTD_A: u32 = 4112;
pub const DAQmx_AI_RTD_B: u32 = 4113;
pub const DAQmx_AI_RTD_C: u32 = 4115;

pub const DAQmxWarningPALBadOffset: u32 = 50007;
pub const DAQmxWarningPALBadCount: u32 = 50008;
pub const DAQmxWarningPALBadReadMode: u32 = 50009;
pub const DAQmxWarningPALBadReadOffset: u32 = 50010;
pub const DAQmxWarningPALBadReadCount: u32 = 50011;
pub const DAQmxWarningPALBadWriteMode: u32 = 50012;
pub const DAQmxWarningPALBadWriteOffset: u32 = 50013;
pub const DAQmxWarningPALBadWriteCount: u32 = 50014;
pub const DAQmxWarningPALBadAddressClass: u32 = 50015;
pub const DAQmxWarningPALBadWindowType: u32 = 50016;
pub const DAQmxWarningPALBadThreadMultitask: u32 = 50019;
pub const DAQmxWarningPALResourceOwnedBySystem: u32 = 50100;
pub const DAQmxWarningPALResourceNotAvailable: u32 = 50101;
pub const DAQmxWarningPALResourceNotReserved: u32 = 50102;
pub const DAQmxWarningPALResourceReserved: u32 = 50103;
pub const DAQmxWarningPALResourceNotInitialized: u32 = 50104;
pub const DAQmxWarningPALResourceInitialized: u32 = 50105;
pub const DAQmxWarningPALResourceBusy: u32 = 50106;
pub const DAQmxWarningPALResourceAmbiguous: u32 = 50107;
pub const DAQmxWarningPALFirmwareFault: u32 = 50151;
pub const DAQmxWarningPALHardwareFault: u32 = 50152;
pub const DAQmxWarningPALOSUnsupported: u32 = 50200;
pub const DAQmxWarningPALOSFault: u32 = 50202;
pub const DAQmxWarningPALFunctionObsolete: u32 = 50254;
pub const DAQmxWarningPALFunctionNotFound: u32 = 50255;
pub const DAQmxWarningPALFeatureNotSupported: u32 = 50256;
pub const DAQmxWarningPALComponentInitializationFault: u32 = 50258;
pub const DAQmxWarningPALComponentAlreadyLoaded: u32 = 50260;
pub const DAQmxWarningPALComponentNotUnloadable: u32 = 50262;
pub const DAQmxWarningPALMemoryAlignmentFault: u32 = 50351;
pub const DAQmxWarningPALMemoryHeapNotEmpty: u32 = 50355;
pub const DAQmxWarningPALTransferNotInProgress: u32 = 50402;
pub const DAQmxWarningPALTransferInProgress: u32 = 50403;
pub const DAQmxWarningPALTransferStopped: u32 = 50404;
pub const DAQmxWarningPALTransferAborted: u32 = 50405;
pub const DAQmxWarningPALLogicalBufferEmpty: u32 = 50406;
pub const DAQmxWarningPALLogicalBufferFull: u32 = 50407;
pub const DAQmxWarningPALPhysicalBufferEmpty: u32 = 50408;
pub const DAQmxWarningPALPhysicalBufferFull: u32 = 50409;
pub const DAQmxWarningPALTransferOverwritten: u32 = 50410;
pub const DAQmxWarningPALTransferOverread: u32 = 50411;
pub const DAQmxWarningPALDispatcherAlreadyExported: u32 = 50500;
pub const DAQmxWarningPALSyncAbandoned: u32 = 50551;
pub type uInt8 = ::std::os::raw::c_uchar;
pub type int16 = ::std::os::raw::c_short;
pub type uInt16 = ::std::os::raw::c_ushort;
pub type int32 = ::std::os::raw::c_long;
pub type uInt32 = ::std::os::raw::c_ulong;
pub type float64 = f64;
pub type int64 = ::std::os::raw::c_longlong;
pub type uInt64 = ::std::os::raw::c_ulonglong;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct CVITime {
    pub lsb: uInt64,
    pub msb: int64,
}
#[test]
fn bindgen_test_layout_CVITime() {
    assert_eq!(
        ::std::mem::size_of::<CVITime>(),
        16usize,
        concat!("Size of: ", stringify!(CVITime))
    );
    assert_eq!(
        ::std::mem::align_of::<CVITime>(),
        4usize,
        concat!("Alignment of ", stringify!(CVITime))
    );
    fn test_field_lsb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CVITime>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lsb) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(CVITime),
                "::",
                stringify!(lsb)
            )
        );
    }
    test_field_lsb();
    fn test_field_msb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CVITime>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msb) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(CVITime),
                "::",
                stringify!(msb)
            )
        );
    }
    test_field_msb();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CVIAbsoluteTime {
    pub cviTime: CVITime,
    pub u32Data: [uInt32; 4usize],
}
#[test]
fn bindgen_test_layout_CVIAbsoluteTime() {
    assert_eq!(
        ::std::mem::size_of::<CVIAbsoluteTime>(),
        16usize,
        concat!("Size of: ", stringify!(CVIAbsoluteTime))
    );
    assert_eq!(
        ::std::mem::align_of::<CVIAbsoluteTime>(),
        4usize,
        concat!("Alignment of ", stringify!(CVIAbsoluteTime))
    );
    fn test_field_cviTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CVIAbsoluteTime>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cviTime) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(CVIAbsoluteTime),
                "::",
                stringify!(cviTime)
            )
        );
    }
    test_field_cviTime();
    fn test_field_u32Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CVIAbsoluteTime>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).u32Data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(CVIAbsoluteTime),
                "::",
                stringify!(u32Data)
            )
        );
    }
    test_field_u32Data();
}
pub type bool32 = uInt32;
pub type TaskHandle = *mut ::std::os::raw::c_void;
pub type CalHandle = uInt32;
extern "C" {
    pub fn DAQmxLoadTask(
        taskName: *const ::std::os::raw::c_char,
        taskHandle: *mut TaskHandle,
    ) -> int32;
}
extern "C" {
    pub fn DAQmxCreateTask(
        taskName: *const ::std::os::raw::c_char,
        taskHandle: *mut TaskHandle,
    ) -> int32;
}
extern "C" {
    pub fn DAQmxAddGlobalChansToTask(
        taskHandle: TaskHandle,
        channelNames: *const ::std::os::raw::c_char,
    ) -> int32;
}
extern "C" {
    pub fn DAQmxStartTask(taskHandle: TaskHandle) -> int32;
}
extern "C" {
    pub fn DAQmxStopTask(taskHandle: TaskHandle) -> int32;
}
extern "C" {
    pub fn DAQmxClearTask(taskHandle: TaskHandle) -> int32;
}
extern "C" {
